/*
  ******************************************************************************
  * @file 			( фаил ):   ST7735.h
  * @brief 		( описание ):  	
  ******************************************************************************
  * @attention 	( внимание ):
  ******************************************************************************
  
 */
 
 
#ifndef _ST7735_H
#define _ST7735_H


/* C++ detection */
#ifdef __cplusplus
extern C {
#endif

// Обязательно нужен #include "main.h" 
// чтоб отдельно не подключать файлы связанные с МК и стандартными библиотеками

#include "main.h"
#include "fonts.h"

#include "stdlib.h"
#include "string.h"

extern uint16_t ST7735_Width, ST7735_Height;

//#######  SETUP  ##############################################################################################
		
		//==== выбераем через что будем отправлять через HAL или CMSIS(быстрее) ==================
		//-- нужное оставляем другое коментируем ( важно должно быть только один выбран )---------
		
			// указываем порт SPI для CMSIS ( быстро )-------
			// так как у разных МК разные регистры то в функциях корректируем под свой МК
			// на данный момент есть реализация на серию F1 F4 H7 для выбора серии в функциях
			//	void ST7735_SendCmd(uint8_t Cmd);
			//	void ST7735_SendData(uint8_t Data );
			//	void ST7735_SendDataMASS(uint8_t* buff, size_t buff_size);	
			// комментируем и раскомментируем то что нам нужно, также там же редактируем под свой МК если не работает
			#define 	ST7735_SPI_CMSIS 	SPI2
			//-----------------------------------------------
			
			// указываем порт SPI для HAL ( медлено )--------
			//#define 	ST7735_SPI_HAL 		hspi2
			//-----------------------------------------------
			
		//============================================================================
		
		//=== указываем порты ( если в кубе назвали их DC RES CS то тогда нечего указывать не нужно )
		#if defined (DC_GPIO_Port)
		#else
			#define DC_GPIO_Port	GPIOA
			#define DC_Pin			GPIO_PIN_11
		#endif
		
		#if defined (RES_GPIO_Port)
		#else
			#define RES_GPIO_Port   GPIOA
			#define RES_Pin			GPIO_PIN_12
		#endif
		
		//--  Cесли используем порт CS для выбора устройства тогда раскомментировать ------------
		// если у нас одно устройство лучше пин CS притянуть к земле( или на порту подать GND )
		
		#define CS_PORT
		
		//----------------------------------------------------------------------------------------
		#ifdef CS_PORT
			#if defined (CS_GPIO_Port)
			#else
				#define CS_GPIO_Port    GPIOA
				#define CS_Pin			GPIO_PIN_14
			#endif
		#endif
		
		//=============================================================================
		
		//=== выбрать нужный дисплей  ==============================================================
		//-- нужное оставляем другое коментируем ( важно должно быть только один выбран )---------
		
		//	#define  ST7735_IS_160X128_V1		// 1.8" 160 x 128 AliExpress/eBay  display, default orientatio		
		//	#define  ST7735_IS_160X128_V2		// 1.8" 160 x 128 WaveShare ST7735S-based display, default orientation		
		//	#define  ST7735_IS_128X128			// 1.44" 128 x 128 display, default orientation		
			#define  ST7735_IS_160X80			// 0.96" mini 160 x 80 display (it's unlikely you want the default orientation)
		
		//==========================================================================================
		
//##############################################################################################################

#ifdef ST7735_SPI_HAL
	extern SPI_HandleTypeDef ST7735_SPI_HAL;
#endif

extern uint16_t ST7735_X_Start;
extern uint16_t ST7735_Y_Start;

#define RGB565(r, g, b)         (((r & 0xF8) << 8) | ((g & 0xFC) << 3) | ((b & 0xF8) >> 3))

//-- готовые цвета -----------------------
	#define   	ST7735_BLACK   	0x0000
	#define   	ST7735_BLUE    	0x001F
	#define   	ST7735_RED     	0xF800
	#define   	ST7735_GREEN   	0x07E0
	#define 	ST7735_CYAN    	0x07FF
	#define 	ST7735_MAGENTA 	0xF81F
	#define 	ST7735_YELLOW  	0xFFE0
	#define 	ST7735_WHITE   	0xFFFF
//----------------------------------------



// Битовые маски настройки цветности ST7789
#define ST7735_ColorMode_12bit  0x03
#define ST7735_ColorMode_16bit  0x05
#define ST7735_ColorMode_18bit  0x06
//----------------------------------------


#define ST7735_MADCTL_MY  0x80
#define ST7735_MADCTL_MX  0x40
#define ST7735_MADCTL_MV  0x20
#define ST7735_MADCTL_ML  0x10
#define ST7735_MADCTL_RGB 0x00
#define ST7735_MADCTL_BGR 0x08
#define ST7735_MADCTL_MH  0x04
//----------------------------------------

#define ST7735_NOP     0x00
#define ST7735_SWRESET 0x01
#define ST7735_RDDID   0x04
#define ST7735_RDDST   0x09

#define ST7735_SLPIN   0x10
#define ST7735_SLPOUT  0x11
#define ST7735_PTLON   0x12
#define ST7735_NORON   0x13

#define ST7735_INVOFF  0x20
#define ST7735_INVON   0x21
#define ST7735_DISPOFF 0x28
#define ST7735_DISPON  0x29
#define ST7735_CASET   0x2A
#define ST7735_RASET   0x2B
#define ST7735_RAMWR   0x2C
#define ST7735_RAMRD   0x2E

#define ST7735_PTLAR   0x30
#define ST7735_COLMOD  0x3A
#define ST7735_MADCTL  0x36

#define ST7735_FRMCTR1 0xB1
#define ST7735_FRMCTR2 0xB2
#define ST7735_FRMCTR3 0xB3
#define ST7735_INVCTR  0xB4
#define ST7735_DISSET5 0xB6

#define ST7735_PWCTR1  0xC0
#define ST7735_PWCTR2  0xC1
#define ST7735_PWCTR3  0xC2
#define ST7735_PWCTR4  0xC3
#define ST7735_PWCTR5  0xC4
#define ST7735_VMCTR1  0xC5

#define ST7735_RDID1   0xDA
#define ST7735_RDID2   0xDB
#define ST7735_RDID3   0xDC
#define ST7735_RDID4   0xDD

#define ST7735_PWCTR6  0xFC

#define ST7735_GMCTRP1 0xE0
#define ST7735_GMCTRN1 0xE1
//---------------------------------------

#define DELAY 0x80

//---------------------------------------



//===========================================================================================
// 1.8" 160 x 128 AliExpress/eBay  display, default orientation

#ifdef ST7735_IS_160X128_V1
	#define ST7735_WIDTH  128
	#define ST7735_HEIGHT 160
	#define ST7735_XSTART 0
	#define ST7735_YSTART 0
	#define ST7735_ROTATION (ST7735_MADCTL_MX | ST7735_MADCTL_MY)
#endif

//===========================================================================================

//===========================================================================================
// 1.8" 160 x 128 WaveShare ST7735S-based display, default orientation

#ifdef ST7735_IS_160X128_V2
	#define ST7735_WIDTH  128
	#define ST7735_HEIGHT 160
	#define ST7735_XSTART 2
	#define ST7735_YSTART 1
	#define ST7735_ROTATION (ST7735_MADCTL_MX | ST7735_MADCTL_MY | ST7735_MADCTL_RGB)
#endif

//===========================================================================================

//===========================================================================================
// 1.44" 128 x 128 display, default orientation

#ifdef ST7735_IS_128X128
	#define ST7735_WIDTH  128
	#define ST7735_HEIGHT 128
	#define ST7735_XSTART 2
	#define ST7735_YSTART 3
	#define ST7735_ROTATION (ST7735_MADCTL_MX | ST7735_MADCTL_MY | ST7735_MADCTL_BGR)
#endif

//===========================================================================================

//===========================================================================================
// 0.96" mini 160 x 80 display (it's unlikely you want the default orientation)

#ifdef ST7735_IS_160X80 
	#define ST7735_XSTART 26
	#define ST7735_YSTART 1
	#define ST7735_WIDTH  80
	#define ST7735_HEIGHT 160 
	#define ST7735_ROTATION (ST7735_MADCTL_MX | ST7735_MADCTL_MY | ST7735_MADCTL_BGR)
#endif

//===========================================================================================

/****************************/

//###########################################################################################
//###########################################################################################



//==============================================================================
// Процедура инициализации дисплея
//==============================================================================
void ST7735_Init(void);
//==============================================================================


//==============================================================================
// Процедура управления SPI
//==============================================================================
void ST7735_Select(void);
//==============================================================================


//==============================================================================
// Процедура управления SPI
//==============================================================================
void ST7735_Unselect(void);
//==============================================================================


//==============================================================================
// Процедура отправки данных для инициализации дисплея
//==============================================================================
static void ST7735_ExecuteCommandList(const uint8_t *addr);
//==============================================================================


//==============================================================================
// Процедура вывода цветного изображения на дисплей
//==============================================================================
void ST7735_DrawImage(uint16_t x, uint16_t y, uint16_t w, uint16_t h, const uint16_t* data);	
//==============================================================================


//==============================================================================
// Процедура аппаратного сброса дисплея (ножкой RESET)
//==============================================================================
void ST7735_HardReset(void);
//==============================================================================


//==============================================================================
// Процедура отправки команды в дисплей
//==============================================================================
void ST7735_SendCmd(uint8_t Cmd);
//==============================================================================


//==============================================================================
// Процедура отправки данных (параметров) в дисплей 1 BYTE
//==============================================================================
void ST7735_SendData(uint8_t Data );
//==============================================================================
	
	
//==============================================================================
// Процедура отправки данных (параметров) в дисплей MASS
//==============================================================================
void ST7735_SendDataMASS(uint8_t* buff, size_t buff_size);
//==============================================================================


//==============================================================================
// Процедура включения режима сна
//==============================================================================
void ST7735_SleepModeEnter( void );
//==============================================================================


//==============================================================================
// Процедура отключения режима сна
//==============================================================================
void ST7735_SleepModeExit( void );
//==============================================================================


//==============================================================================
// Процедура настройки формата цвета
//==============================================================================
void ST7735_ColorModeSet(uint8_t ColorMode);
//==============================================================================


//==============================================================================
// Процедура настройки отображения  
//==============================================================================
void ST7735_MemAccessModeSet(uint8_t Rotation, uint8_t VertMirror, uint8_t HorizMirror, uint8_t IsBGR);
//==============================================================================


//==============================================================================
// Процедура включения/отключения режима частичного заполнения экрана
//==============================================================================
void ST7735_InversionMode(uint8_t Mode);
//==============================================================================


//==============================================================================
// Процедура закрашивает экран цветом color
//==============================================================================
void ST7735_FillScreen(uint16_t color);
//==============================================================================


//==============================================================================
// Процедура очистки экрана - закрашивает экран цветом черный
//==============================================================================
void ST7735_Clear(void);
//==============================================================================

//==============================================================================
// Процедура заполнения прямоугольника цветом color
//==============================================================================
void ST7735_FillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура установка границ экрана для заполнения
//==============================================================================
void ST7735_SetWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1);
//==============================================================================


//==============================================================================
// Процедура записи данных в дисплей
//==============================================================================
void ST7735_RamWrite(uint16_t *pBuff, uint16_t Len);
//==============================================================================


//==============================================================================
// Процедура установки начального и конечного адресов колонок
//==============================================================================
static void ST7735_ColumnSet(uint16_t ColumnStart, uint16_t ColumnEnd);
//==============================================================================


//==============================================================================
// Процедура установки начального и конечного адресов строк
//==============================================================================
static void ST7735_RowSet(uint16_t RowStart, uint16_t RowEnd);
//==============================================================================


//==============================================================================
// Процедура управления подсветкой (ШИМ)
//==============================================================================
void ST7735_SetBL(uint8_t Value);
//==============================================================================


//==============================================================================
// Процедура включения/отключения питания дисплея
//==============================================================================
void ST7735_DisplayPower(uint8_t On);
//==============================================================================


//==============================================================================
// Процедура рисования прямоугольника ( пустотелый )
//==============================================================================
void ST7735_DrawRectangle(int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура вспомогательная для --- Процедура рисования прямоугольника ( заполненый )
//==============================================================================
static void SwapInt16Values(int16_t *pValue1, int16_t *pValue2);
//==============================================================================


//==============================================================================
// Процедура рисования прямоугольника ( заполненый )
//==============================================================================
void ST7735_DrawRectangleFilled(int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t fillcolor);
//==============================================================================


//==============================================================================
// Процедура вспомогательная для --- Процедура рисования линии
//==============================================================================
static void ST7735_DrawLine_Slow(int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура рисования линии
//==============================================================================
void ST7735_DrawLine(int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура рисования треугольника ( пустотелый )
//==============================================================================
void ST7735_DrawTriangle(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t x3, uint16_t y3, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура рисования треугольника ( заполненый )
//==============================================================================
void ST7735_DrawFilledTriangle(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t x3, uint16_t y3, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура окрашивает 1 пиксель дисплея
//==============================================================================
void ST7735_DrawPixel(int16_t x, int16_t y, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура рисования круг ( заполненый )
//==============================================================================
void ST7735_DrawCircleFilled(int16_t x0, int16_t y0, int16_t radius, uint16_t fillcolor);
//==============================================================================


//==============================================================================
// Процедура рисования круг ( пустотелый )
//==============================================================================
void ST7735_DrawCircle(int16_t x0, int16_t y0, int16_t radius, uint16_t color);
//==============================================================================


//==============================================================================
// Процедура рисования символа ( 1 буква или знак )
//==============================================================================
char ST7735_DrawChar(uint16_t x, uint16_t y, uint16_t TextColor, uint16_t BgColor, uint8_t TransparentBg, FontDef_t* Font, uint8_t multiplier, unsigned char ch);
//==============================================================================


//==============================================================================
// Процедура рисования строки
//==============================================================================
char ST7735_print(uint16_t x, uint16_t y, uint16_t TextColor, uint16_t BgColor, uint8_t TransparentBg, FontDef_t* Font, uint8_t multiplier, char *str);
//==============================================================================


//==============================================================================
// Процедура ротации ( положение ) дисплея
//==============================================================================
// па умолчанию 1 режим ( всего 1, 2, 3, 4 )
void ST7735_rotation( uint8_t rotation );
//==============================================================================


//==============================================================================
// Процедура рисования иконки монохромной
//==============================================================================
void ST7735_DrawBitmap(int16_t x, int16_t y, const unsigned char* bitmap, int16_t w, int16_t h, uint16_t color);
//==============================================================================




/* C++ detection */
#ifdef __cplusplus
}
#endif

#endif	/*	_ST7735_H */

/************************ (C) COPYRIGHT GKP *****END OF FILE****/
